In [1]:
import warnings
warnings.filterwarnings('ignore')

In [2]:
import pandas as pd
from sklearn import preprocessing
import numpy as np

In [3]:
df = pd.read_csv('supershops.csv')

In [4]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [5]:
df.shape

(50, 5)

In [6]:
df1 = df.copy()
df2 = df.copy()
df3 = df.copy()
df4 = df.copy()
df5 = df.copy()
df6 = df.copy()
df7 = df.copy()
df8 = df.copy()

# normalization

In [7]:
from sklearn.preprocessing import MinMaxScaler

In [8]:
m = MinMaxScaler(feature_range=(0,1))

In [9]:
ms = m.fit(df[['Marketing Spend']])
ms

MinMaxScaler()

In [10]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [11]:
df['Marketing Spend'] = ms.transform(df[['Marketing Spend']])

In [12]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

In [13]:
df['Administration'] = m.fit_transform(df[['Administration']])

In [14]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744  471784.10    Dhaka  192261.83
1         0.983359        0.761972  443898.53      Ctg  191792.06
2         0.927985        0.379579  407934.54  Rangpur  191050.39
3         0.873136        0.512998  383199.62    Dhaka  182901.99
4         0.859438        0.305328  366168.42  Rangpur  166187.94

In [15]:
df['Transport'] = m.fit_transform(df[['Transport']])

In [16]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744   1.000000    Dhaka  192261.83
1         0.983359        0.761972   0.940893      Ctg  191792.06
2         0.927985        0.379579   0.864664  Rangpur  191050.39
3         0.873136        0.512998   0.812235    Dhaka  182901.99
4         0.859438        0.305328   0.776136  Rangpur  166187.94

# standardization

In [17]:
from sklearn.preprocessing import StandardScaler

In [18]:
standard = StandardScaler()

In [19]:
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [20]:
standard

StandardScaler()

In [21]:
standard_scale = standard.fit(df2[['Marketing Spend', 'Administration', 'Transport']])

In [22]:
#df2[['Marketing Spend', 'Administration', 'Transport']] = s.transform(df2[['Marketing Spend', 'Administration', 'Transport']])
df2[['Marketing Spend', 'Administration', 'Transport']] = standard_scale.fit_transform(df2[['Marketing Spend', 'Administration', 'Transport']])

In [23]:
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753   2.165287    Dhaka  192261.83
1         1.955860        1.082807   1.929843      Ctg  191792.06
2         1.754364       -0.728257   1.626191  Rangpur  191050.39
3         1.554784       -0.096365   1.417348    Dhaka  182901.99
4         1.504937       -1.079919   1.273550  Rangpur  166187.94

# RobustScaler

In [24]:
from sklearn.preprocessing import RobustScaler

In [25]:
robust = RobustScaler()

In [26]:
robust

RobustScaler()

In [27]:
df3.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [28]:
robust_scale = robust.fit(df3[['Marketing Spend', 'Administration', 'Transport' ]])

In [29]:
df3[['Marketing Spend', 'Administration', 'Transport']] = robust_scale.fit_transform(df3[['Marketing Spend', 'Administration', 'Transport']])

In [30]:
df3.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530        0.345355   1.552016    Dhaka  192261.83
1         1.452113        0.697565   1.383714      Ctg  191792.06
2         1.303634       -0.524290   1.166654  Rangpur  191050.39
3         1.156567       -0.097977   1.017368    Dhaka  182901.99
4         1.119836       -0.761543   0.914576  Rangpur  166187.94

# Max Absulate Scaler

In [31]:
from sklearn.preprocessing import MaxAbsScaler

In [32]:
max_ab = MaxAbsScaler()

In [33]:
max_ab

MaxAbsScaler()

In [34]:
max_absolate = max_ab.fit(df4[['Marketing Spend', 'Administration', 'Transport']])

In [35]:
df4[['Marketing Spend', 'Administration', 'Transport']] = max_absolate.fit_transform(df4[['Marketing Spend', 'Administration', 'Transport']])

In [36]:
df4.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.749527   1.000000    Dhaka  192261.83
1         0.983359        0.828805   0.940893      Ctg  191792.06
2         0.927985        0.553781   0.864664  Rangpur  191050.39
3         0.873136        0.649738   0.812235    Dhaka  182901.99
4         0.859438        0.500378   0.776136  Rangpur  166187.94

# using for loops

In [37]:
from sklearn.preprocessing import MinMaxScaler  ######normalization

In [38]:
normaliz = MinMaxScaler(feature_range=(0,1))

In [39]:
normaliz

MinMaxScaler()

In [40]:
df5.dtypes

Marketing Spend    float64
Administration     float64
Transport          float64
Area                object
Profit             float64
dtype: object

In [41]:
df5.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [42]:
for x in df5 :
    if(df5[x].dtypes == 'float64'):
        df5[x] =normaliz.fit_transform(df5[[x]])

In [43]:
df5.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.692617        0.651744   1.000000    Dhaka  1.000000
1         0.983359        0.761972   0.940893      Ctg  0.997355
2         0.927985        0.379579   0.864664  Rangpur  0.993178
3         0.873136        0.512998   0.812235    Dhaka  0.947292
4         0.859438        0.305328   0.776136  Rangpur  0.853171

In [44]:
from sklearn.preprocessing import StandardScaler      ###### standard scaler

In [45]:
s_scale_loop = StandardScaler()

In [46]:
s_scale_loop

StandardScaler()

In [47]:
df6.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [48]:
df6.dtypes

Marketing Spend    float64
Administration     float64
Transport          float64
Area                object
Profit             float64
dtype: object

In [49]:
for x in df6:
    if(df6[x].dtypes == 'float64'):
        df6[x] = s_scale_loop.fit_transform(df6[[x]])

In [50]:
df6.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.897913        0.560753   2.165287    Dhaka  2.011203
1         1.955860        1.082807   1.929843      Ctg  1.999430
2         1.754364       -0.728257   1.626191  Rangpur  1.980842
3         1.554784       -0.096365   1.417348    Dhaka  1.776627
4         1.504937       -1.079919   1.273550  Rangpur  1.357740

In [51]:
from sklearn.preprocessing import RobustScaler #############robust scaler

In [52]:
robust_loop = RobustScaler()

In [53]:
robust_loop

RobustScaler()

In [54]:
df7.dtypes

Marketing Spend    float64
Administration     float64
Transport          float64
Area                object
Profit             float64
dtype: object

In [55]:
for x in df7:
    if(df7[x].dtypes == 'float64'):
        df7[x] = robust_loop.fit_transform(df7[[x]])

In [56]:
df7.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.672530        0.345355   1.552016    Dhaka  1.698340
1         1.452113        0.697565   1.383714      Ctg  1.688874
2         1.303634       -0.524290   1.166654  Rangpur  1.673929
3         1.156567       -0.097977   1.017368    Dhaka  1.509736
4         1.119836       -0.761543   0.914576  Rangpur  1.172943

In [57]:
from sklearn.preprocessing import MaxAbsScaler

In [58]:
maxabs_loop = MaxAbsScaler()

In [59]:
maxabs_loop

MaxAbsScaler()

In [60]:
df8.dtypes

Marketing Spend    float64
Administration     float64
Transport          float64
Area                object
Profit             float64
dtype: object

In [61]:
for x in df8:
    if(df8[x].dtypes == 'float64'):
        df8[x] = maxabs_loop.fit_transform(df8[[x]])

In [62]:
df8.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.692617        0.749527   1.000000    Dhaka  1.000000
1         0.983359        0.828805   0.940893      Ctg  0.997557
2         0.927985        0.553781   0.864664  Rangpur  0.993699
3         0.873136        0.649738   0.812235    Dhaka  0.951317
4         0.859438        0.500378   0.776136  Rangpur  0.864383